In [13]:
import pandas as pd

In [14]:
people = {
    "first" : ["Anish", "Ramish", "Samish", "Bamish"],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki"],
    "email" : ["anishramish56@gmail.com", "mainaliramish89@gmail.com", "shresthasamish28@gmail.com", "bamishkarki819@gmail.com"]
}

In [15]:
mydf = pd.DataFrame(people)
mydf

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [16]:
mydf['first']

0     Anish
1    Ramish
2    Samish
3    Bamish
Name: first, dtype: object

In [17]:
mydf.iloc[0:2]

    first     last                      email
0   Anish   Khadka    anishramish56@gmail.com
1  Ramish  Mainali  mainaliramish89@gmail.com

# Day 3 - All About Indexes

In [18]:
mydf

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [19]:
# The far left has indexes, range of numbers i.e. integer identifiers
# This could be a unique value, but pandas doesn't enforce it to be unique
mydf['email']

0       anishramish56@gmail.com
1     mainaliramish89@gmail.com
2    shresthasamish28@gmail.com
3      bamishkarki819@gmail.com
Name: email, dtype: object

In [20]:
mydf.set_index('email') # the original df is not modified
mydf.set_index('email', inplace=True) # the original df is modified
mydf

                             first      last
email
anishramish56@gmail.com      Anish    Khadka
mainaliramish89@gmail.com   Ramish   Mainali
shresthasamish28@gmail.com  Samish  Shrestha
bamishkarki819@gmail.com    Bamish     Karki

In [21]:
mydf.index # The indexes of the dataframe

Index(['anishramish56@gmail.com', 'mainaliramish89@gmail.com',
       'shresthasamish28@gmail.com', 'bamishkarki819@gmail.com'],
      dtype='object', name='email')

In [22]:
mydf.loc['shresthasamish28@gmail.com']

first      Samish
last     Shrestha
Name: shresthasamish28@gmail.com, dtype: object

In [23]:
mydf.iloc[0] # integer location works but previoud df.loc[0] won't work

first     Anish
last     Khadka
Name: anishramish56@gmail.com, dtype: object

In [24]:
# to reset the index
mydf.reset_index(inplace=True)
mydf

                        email   first      last
0     anishramish56@gmail.com   Anish    Khadka
1   mainaliramish89@gmail.com  Ramish   Mainali
2  shresthasamish28@gmail.com  Samish  Shrestha
3    bamishkarki819@gmail.com  Bamish     Karki